incompressible/simpleFoam/platypus-2D-car/template/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        name inlet;
        patchInfo
        {
            type            patch;
        }
        constructFrom patches;
        patches (inletMesh);
    }
    {
        name outlet;
        patchInfo
        {
            type            patch;
        }
        constructFrom patches;
        patches (outletMesh);
    }
    {
        name wallGround;
        patchInfo
        {
            type            wall;
        }
        constructFrom patches;
        patches (wallGroundMesh);
    }
    {
        name wallCar;
        patchInfo
        {
            type            wall;
        }
        constructFrom patches;
        patches (wallCarMesh);
    }
    {
        name slipTop;
        patchInfo
        {
            type            patch;
        }
        constructFrom patches;
        patches (slipTopMesh);
    }
    
    {
        name frontAndBack;
        patchInfo
        {
            type            empty;
        }
        constructFrom patches;
        patches (topEmptyFaces bottomEmptyFaces);
    }
    
);

// ************************************************************************* //
